[
{"id":"S0001","desc":"Skill in conducting vulnerability scans and recognizing vulnerabilities in security systems."},
{"id":"S0002","desc":"Skill in allocating storage capacity in the design of data management systems."},
{"id":"S0003","desc":"Skill of identifying, capturing, containing, and reporting malware."},
{"id":"S0004","desc":"Skill in analyzing network traffic capacity and performance characteristics."},
{"id":"S0005","desc":"Skill in applying and incorporating information technologies into proposed solutions."},
{"id":"S0006","desc":"Skill in applying confidentiality, integrity, and availability principles."},
{"id":"S0007","desc":"Skill in applying host/network access controls (e.g., access control list)."},
{"id":"S0008","desc":"Skill in applying organization-specific systems analysis principles and techniques."},
{"id":"S0009","desc":"Skill in assessing the robustness of security systems and designs."},
{"id":"S0010","desc":"Skill in conducting capabilities and requirements analysis."},
{"id":"S0011","desc":"Skill in conducting information searches."},
{"id":"S0012","desc":"Skill in conducting knowledge mapping (e.g., map of knowledge repositories)."},
{"id":"S0013","desc":"Skill in conducting queries and developing algorithms to analyze data structures."},
{"id":"S0014","desc":"Skill in conducting software debugging."},
{"id":"S0015","desc":"Skill in conducting test events."},
{"id":"S0016","desc":"Skill in configuring and optimizing software."},
{"id":"S0017","desc":"Skill in creating and utilizing mathematical or statistical models."},
{"id":"S0018","desc":"Skill in creating policies that reflect system security objectives."},
{"id":"S0019","desc":"Skill in creating programs that validate and process multiple inputs including command line arguments, environmental variables, and input streams."},
{"id":"S0020","desc":"Skill in developing and deploying signatures."},
{"id":"S0021","desc":"Skill in designing a data analysis structure (i.e., the types of data a test must generate and how to analyze that data)."},
{"id":"S0022","desc":"Skill in designing countermeasures to identified security risks."},
{"id":"S0023","desc":"Skill in designing security controls based on cybersecurity principles and tenets."},
{"id":"S0024","desc":"Skill in designing the integration of hardware and software solutions."},
{"id":"S0025","desc":"Skill in detecting host and network based intrusions via intrusion detection technologies (e.g., Snort, Suricata, Bro)."},
{"id":"S0026","desc":"Skill in determining an appropriate level of test rigor for a given system."},
{"id":"S0027","desc":"Skill in determining how a security system should work (including its resilience and dependability capabilities) and how changes in conditions, operations, or the environment will affect these outcomes."},
{"id":"S0028","desc":"Skill in developing data dictionaries."},
{"id":"S0029","desc":"Skill in developing data models."},
{"id":"S0030","desc":"Skill in developing operations-based testing scenarios."},
{"id":"S0031","desc":"Skill in developing and applying security system access controls."},
{"id":"S0032","desc":"Skill in developing, testing, and implementing network infrastructure contingency and recovery plans"},
{"id":"S0033","desc":"Skill in diagnosing connectivity problems."},
{"id":"S0034","desc":"Skill in discerning the protection needs (i.e., security controls) of information systems and networks."},
{"id":"S0035","desc":"Skill in establishing a routing schema."},
{"id":"S0036","desc":"Skill in evaluating the adequacy of security designs."},
{"id":"S0037","desc":"Skill in generating queries and reports."},
{"id":"S0038","desc":"Skill in identifying measures or indicators of system performance and the actions needed to improve or correct performance, relative to the goals of the system."},
{"id":"S0039","desc":"Skill in identifying possible causes of degradation of system performance or availability and initiating actions needed to mitigate this degradation."},
{"id":"S0040","desc":"Skill in implementing, maintaining, and improving established network security practices."},
{"id":"S0041","desc":"Skill in installing, configuring, and troubleshooting LAN and WAN components such as routers, hubs, and switches."},
{"id":"S0042","desc":"Skill in maintaining databases. (i.e., backup, restore, delete data, transaction log files, etc.)."},
{"id":"S0043","desc":"Skill in maintaining directory services. (e.g., Microsoft Active Directory, LDAP, etc.)."},
{"id":"S0044","desc":"Skill in mimicking threat behaviors."},
{"id":"S0045","desc":"Skill in optimizing database performance."},
{"id":"S0046","desc":"Skill in performing packet-level analysis using appropriate tools (e.g., Wireshark, tcpdump)."},
{"id":"S0047","desc":"Skill in preserving evidence integrity according to standard operating procedures or national standards."},
{"id":"S0048","desc":"Skill in systems integration testing."},
{"id":"S0049","desc":"Skill in the measuring and reporting of intellectual capital."},
{"id":"S0050","desc":"Skill in design modeling and building use cases (e.g., unified modeling language)."},
{"id":"S0051","desc":"Skill in the use of penetration testing tools and techniques."},
{"id":"S0052","desc":"Skill in the use of social engineering techniques. (e.g., phishing, baiting, tailgating, etc.)."},
{"id":"S0053","desc":"Skill in tuning sensors."},
{"id":"S0054","desc":"Skill in using incident handling methodologies."},
{"id":"S0055","desc":"Skill in using knowledge management technologies."},
{"id":"S0056","desc":"Skill in using network management tools to analyze network traffic patterns (e.g., simple network management protocol)."},
{"id":"S0057","desc":"Skill in using protocol analyzers."},
{"id":"S0058","desc":"Skill in using the appropriate tools for repairing software, hardware, and peripheral equipment of a system."},
{"id":"S0059","desc":"Skill in using Virtual Private Network (VPN) devices and encryption."},
{"id":"S0060","desc":"Skill in writing code in a currently supported programming language (e.g., Java, C++)."},
{"id":"S0061","desc":"Skill in writing test plans."},
{"id":"S0062","desc":"Skill in analyzing memory dumps to extract information."},
{"id":"S0063","desc":"Skill in collecting data from a variety of cyber defense resources."},
{"id":"S0064","desc":"Skill in developing and executing technical training programs and curricula."},
{"id":"S0065","desc":"Skill in identifying and extracting data of forensic interest in diverse media (i.e., media forensics)."},
{"id":"S0066","desc":"Skill in identifying gaps in technical capabilities."},
{"id":"S0067","desc":"Skill in identifying, modifying, and manipulating applicable system components within Windows, Unix, or Linux (e.g., passwords, user accounts, files)."},
{"id":"S0068","desc":"Skill in collecting, processing, packaging, transporting, and storing electronic evidence to avoid alteration, loss, physical damage, or destruction of data."},
{"id":"S0069","desc":"Skill in setting up a forensic workstation"},
{"id":"S0070","desc":"Skill in talking to others to convey information effectively."},
{"id":"S0071","desc":"Skill in using forensic tool suites (e.g., EnCase, Sleuthkit, FTK)."},
{"id":"S0072","desc":"Skill in using scientific rules and methods to solve problems."},
{"id":"S0073","desc":"Skill in using virtual machines. (e.g., Microsoft Hyper-V, VMWare vSphere, Citrix XenDesktop/Server, Amazon Elastic Compute Cloud, etc.)."},
{"id":"S0074","desc":"Skill in physically disassembling PCs."},
{"id":"S0075","desc":"Skill in conducting forensic analyses in multiple operating system environments (e.g., mobile device systems)."},
{"id":"S0076","desc":"Skill in configuring and utilizing software-based computer protection tools (e.g., software firewalls, antivirus software, anti-spyware)."},
{"id":"S0077","desc":"Skill in securing network communications."},
{"id":"S0078","desc":"Skill in recognizing and categorizing types of vulnerabilities and associated attacks."},
{"id":"S0079","desc":"Skill in protecting a network against malware. (e.g., NIPS, anti-malware, restrict/prevent external devices, spam filters)."},
{"id":"S0080","desc":"Skill in performing damage assessments."},
{"id":"S0081","desc":"Skill in using network analysis tools to identify vulnerabilities. (e.g., fuzzing, nmap, etc.)."},
{"id":"S0082","desc":"Skill in evaluating test plans for applicability and completeness."},
{"id":"S0083","desc":"Skill in integrating black box security testing tools into quality assurance process of software releases."},
{"id":"S0084","desc":"Skill in configuring and utilizing network protection components (e.g., Firewalls, VPNs, network intrusion detection systems)."},
{"id":"S0085","desc":"Skill in conducting audits or reviews of technical systems."},
{"id":"S0086","desc":"Skill in evaluating the trustworthiness of the supplier and/or product."},
{"id":"S0087","desc":"Skill in deep analysis of captured malicious code (e.g., malware forensics)."},
{"id":"S0088","desc":"Skill in using binary analysis tools (e.g., Hexedit, command code xxd, hexdump)."},
{"id":"S0089","desc":"Skill in one-way hash functions (e.g., Secure Hash Algorithm [SHA], Message Digest Algorithm [MD5])."},
{"id":"S0090","desc":"Skill in analyzing anomalous code as malicious or benign."},
{"id":"S0091","desc":"Skill in analyzing volatile data."},
{"id":"S0092","desc":"Skill in identifying obfuscation techniques."},
{"id":"S0093","desc":"Skill in interpreting results of debugger to ascertain tactics, techniques, and procedures."},
{"id":"S0094","desc":"Skill in reading Hexadecimal data."},
{"id":"S0095","desc":"Skill in identifying common encoding techniques (e.g., Exclusive Disjunction [XOR], American Standard Code for Information Interchange [ASCII], Unicode, Base64, Uuencode, Uniform Resource Locator [URL] encode)."},
{"id":"S0096","desc":"Skill in reading and interpreting signatures (e.g., snort)."},
{"id":"S0097","desc":"Skill in applying security controls."},
{"id":"S0100","desc":"Skill in utilizing or developing learning activities (e.g., scenarios, instructional games, interactive exercises)."},
{"id":"S0101","desc":"Skill in utilizing technologies (e.g., SmartBoards, websites, computers, projectors) for instructional purposes."},
{"id":"S0102","desc":"Skill in applying technical delivery capabilities."},
{"id":"S0103","desc":"Skill in assessing the predictive power and subsequent generalizability of a model."},
{"id":"S0104","desc":"Skill in conducting Test Readiness Reviews."},
{"id":"S0106","desc":"Skill in data pre-processing (e.g., imputation, dimensionality reduction, normalization, transformation, extraction, filtering, smoothing)."},
{"id":"S0107","desc":"Skill in designing and documenting overall program Test & Evaluation strategies."},
{"id":"S0108","desc":"Skill in developing workforce and position qualification standards"},
{"id":"S0109","desc":"Skill in identifying hidden patterns or relationships."},
{"id":"S0110","desc":"Skill in identifying Test & Evaluation infrastructure (people, ranges, tools, instrumentation) requirements."},
{"id":"S0111","desc":"Skill in interfacing with customers."},
{"id":"S0112","desc":"Skill in managing test assets, test resources, and test personnel to ensure effective completion of test events."},
{"id":"S0113","desc":"Skill in performing format conversions to create a standard representation of the data."},
{"id":"S0114","desc":"Skill in performing sensitivity analysis."},
{"id":"S0115","desc":"Skill in preparing Test & Evaluation reports."},
{"id":"S0116","desc":"Skill in designing multi-level security/cross domain solutions."},
{"id":"S0117","desc":"Skill in providing Test & Evaluation resource estimate."},
{"id":"S0118","desc":"Skill in developing machine understandable semantic ontologies."},
{"id":"S0119","desc":"Skill in Regression Analysis (e.g., Hierarchical Stepwise, Generalized Linear Model, Ordinary Least Squares, Tree-Based Methods, Logistic)."},
{"id":"S0120","desc":"Skill in reviewing logs to identify evidence of past intrusions."},
{"id":"S0121","desc":"Skill in system, network, and OS hardening techniques. (e.g., remove unnecessary services, password policies, network segmentation, enable logging, least privilege, etc.)."},
{"id":"S0122","desc":"Skill in the use of design methods."},
{"id":"S0123","desc":"Skill in transformation analytics (e.g., aggregation, enrichment, processing)."},
{"id":"S0124","desc":"Skill in troubleshooting and diagnosing cyber defense infrastructure anomalies and work through resolution."},
{"id":"S0125","desc":"Skill in using basic descriptive statistics and techniques (e.g., normality, model distribution, scatter plots)."},
{"id":"S0126","desc":"Skill in using data analysis tools (e.g., Excel, STATA SAS, SPSS)."},
{"id":"S0127","desc":"Skill in using data mapping tools."},
{"id":"S0128","desc":"Skill in using manpower and personnel IT systems."},
{"id":"S0129","desc":"Skill in using outlier identification and removal techniques."},
{"id":"S0130","desc":"Skill in writing scripts using R, Python, PIG, HIVE, SQL, etc."},
{"id":"S0131","desc":"Skill in analyzing malware."},
{"id":"S0132","desc":"Skill in conducting bit-level analysis."},
{"id":"S0133","desc":"Skill in processing digital evidence, to include protecting and making legally sound copies of evidence."},
{"id":"S0134","desc":"Skill in conducting reviews of systems."},
{"id":"S0135","desc":"Skill in secure test plan design (e. g. unit, integration, system, acceptance)."},
{"id":"S0136","desc":"Skill in network systems management principles, models, methods (e.g., end-to-end systems performance monitoring), and tools."},
{"id":"S0137","desc":"Skill in conducting application vulnerability assessments."},
{"id":"S0138","desc":"Skill in using Public-Key Infrastructure (PKI) encryption and digital signature capabilities into applications (e.g., S/MIME email, SSL traffic)."},
{"id":"S0139","desc":"Skill in applying security models (e.g., Bell-LaPadula model, Biba integrity model, ClarkWilson integrity model)."},
{"id":"S0140","desc":"Skill in applying the systems engineering process."},
{"id":"S0141","desc":"Skill in assessing security systems designs."},
{"id":"S0142","desc":"Skill in conducting research for troubleshooting novel client-level problems."},
{"id":"S0143","desc":"Skill in conducting system/server planning, management, and maintenance."},
{"id":"S0144","desc":"Skill in correcting physical and technical problems that impact system/server performance."},
{"id":"S0145","desc":"Skill in integrating and applying policies that meet system security objectives."},
{"id":"S0146","desc":"Skill in creating policies that enable systems to meet performance objectives (e.g. traffic routing, SLA's, CPU specifications)."},
{"id":"S0147","desc":"Skill in assessing security controls based on cybersecurity principles and tenets. (e.g., CISCSC, NIST SP 800-53, Cybersecurity Framework, etc.)."},
{"id":"S0148","desc":"Skill in designing the integration of technology processes and solutions, including legacy systems and modern programming languages."},
{"id":"S0149","desc":"Skill in developing applications that can log and handle errors, exceptions, and application faults and logging."},
{"id":"S0150","desc":"Skill in implementing and testing network infrastructure contingency and recovery plans."},
{"id":"S0151","desc":"Skill in troubleshooting failed system components (i.e., servers)"},
{"id":"S0152","desc":"Skill in translating operational requirements into protection needs (i.e., security controls)."},
{"id":"S0153","desc":"Skill in identifying and anticipating system/server performance, availability, capacity, or configuration problems."},
{"id":"S0154","desc":"Skill in installing system and component upgrades. (i.e., servers, appliances, network devices)."},
{"id":"S0155","desc":"Skill in monitoring and optimizing system/server performance."},
{"id":"S0156","desc":"Skill in performing packet-level analysis."},
{"id":"S0157","desc":"Skill in recovering failed systems/servers. (e.g., recovery software, failover clusters, replication, etc.)."},
{"id":"S0158","desc":"Skill in operating system administration. (e.g., account maintenance, data backups, maintain system performance, install and configure new hardware/software)."},
{"id":"S0159","desc":"Skill in configuring and validating network workstations and peripherals in accordance with approved standards and/or specifications."},
{"id":"S0160","desc":"Skill in the use of design modeling (e.g., unified modeling language)."},
{"id":"S0161","desc":"Withdrawn - Integrated into S0160"},
{"id":"S0162","desc":"Skill in sub-netting."},
{"id":"S0163","desc":"Withdrawn - Integrated into S0060"},
{"id":"S0164","desc":"Skill in assessing the application of cryptographic standards."},
{"id":"S0166","desc":"Skill in identifying gaps in technical delivery capabilities."},
{"id":"S0167","desc":"Skill in recognizing vulnerabilities in security systems. (e.g., vulnerability and compliance scanning)."},
{"id":"S0168","desc":"Skill in setting up physical or logical sub-networks that separate an internal local area network (LAN) from other untrusted networks."},
{"id":"S0169","desc":"Skill in conducting trend analysis."},
{"id":"S0170","desc":"Skill in configuring and utilizing computer protection components (e.g., hardware firewalls, servers, routers, as appropriate)."},
{"id":"S0171","desc":"Skill in performing impact/risk assessments."},
{"id":"S0172","desc":"Skill in applying secure coding techniques."},
{"id":"S0173","desc":"Skill in using security event correlation tools."},
{"id":"S0174","desc":"Skill in using code analysis tools."},
{"id":"S0175","desc":"Skill in performing root cause analysis."},
{"id":"S0176","desc":"Skill in administrative planning activities, to include preparation of functional and specific support plans, preparing and managing correspondence, and staffing procedures."},
{"id":"S0177","desc":"Skill in analyzing a target's communication networks."},
{"id":"S0178","desc":"Skill in analyzing essential network data (e.g., router configuration files, routing protocols)."},
{"id":"S0179","desc":"Skill in analyzing language processing tools to provide feedback to enhance tool development."},
{"id":"S0180","desc":"Withdrawn - Integrated into S0062"},
{"id":"S0181","desc":"Skill in analyzing midpoint collection data."},
{"id":"S0182","desc":"Skill in analyzing target communications internals and externals collected from wireless LANs."},
{"id":"S0183","desc":"Skill in analyzing terminal or environment collection data."},
{"id":"S0184","desc":"Skill in analyzing traffic to identify network devices."},
{"id":"S0185","desc":"Skill in applying analytical methods typically employed to support planning and to justify recommended strategies and courses of action."},
{"id":"S0186","desc":"Skill in applying crisis planning procedures."},
{"id":"S0187","desc":"Skill in applying various analytical methods, tools, and techniques (e.g., competing hypotheses; chain of reasoning; scenario  ethods; denial and deception detection; high impact-low probability; network/association or link analysis; Bayesian, Delphi, and Pattern analyses)."},
{"id":"S0188","desc":"Skill in assessing a target's frame of reference (e.g., motivation, technical capability, organizational structure, sensitivities)."},
{"id":"S0189","desc":"Skill in assessing and/or estimating effects generated during and after cyber operations."},
{"id":"S0190","desc":"Skill in assessing current tools to identify needed improvements."},
{"id":"S0191","desc":"Skill in assessing the applicability of available analytical tools to various situations."},
{"id":"S0192","desc":"Skill in auditing firewalls, perimeters, routers, and intrusion detection systems."},
{"id":"S0193","desc":"Skill in complying with the legal restrictions for targeted information."},
{"id":"S0194","desc":"Skill in conducting non-attributable research."},
{"id":"S0195","desc":"Skill in conducting research using all available sources."},
{"id":"S0196","desc":"Skill in conducting research using deep web."},
{"id":"S0197","desc":"Skill in conducting social network analysis, buddy list analysis, and/or cookie analysis."},
{"id":"S0198","desc":"Skill in conducting social network analysis."},
{"id":"S0199","desc":"Skill in creating and extracting important information from packet captures."},
{"id":"S0200","desc":"Skill in creating collection requirements in support of data acquisition activities."},
{"id":"S0201","desc":"Skill in creating plans in support of remote operations. (i.e., hot/warm/cold/alternative sites, disaster recovery)."},
{"id":"S0202","desc":"Skill in data mining techniques (e.g., searching file systems) and analysis."},
{"id":"S0203","desc":"Skill in defining and characterizing all pertinent aspects of the operational environment."},
{"id":"S0204","desc":"Skill in depicting source or collateral data on a network map."},
{"id":"S0205","desc":"Skill in determining appropriate targeting options through the evaluation of available capabilities against desired effects."},
{"id":"S0206","desc":"Skill in determining installed patches on various operating systems and identifying patch signatures."},
{"id":"S0207","desc":"Skill in determining the effect of various router and firewall configurations on traffic patterns and network performance in both LAN and WAN environments."},
{"id":"S0208","desc":"Skill in determining the physical location of network devices."},
{"id":"S0209","desc":"Skill in developing and executing comprehensive cyber operations assessment programs for assessing and validating operational performance characteristics."},
{"id":"S0210","desc":"Skill in developing intelligence reports."},
{"id":"S0211","desc":"Skill in developing or recommending analytic approaches or solutions to problems and situations for which information is incomplete or for which no precedent exists."},
{"id":"S0212","desc":"Skill in disseminating items of highest intelligence value in a timely manner."},
{"id":"S0213","desc":"Skill in documenting and communicating complex technical and programmatic information."},
{"id":"S0214","desc":"Skill in evaluating accesses for intelligence value."},
{"id":"S0215","desc":"Skill in evaluating and interpreting metadata"},
{"id":"S0216","desc":"Skill in evaluating available capabilities against desired effects to provide effective courses of action."},
{"id":"S0217","desc":"Skill in evaluating data sources for relevance, reliability, and objectivity."},
{"id":"S0218","desc":"Skill in evaluating information for reliability, validity, and relevance."},
{"id":"S0219","desc":"Skill in evaluating information to recognize relevance, priority, etc."},
{"id":"S0220","desc":"Skill in exploiting/querying organizational and/or partner collection databases."},
{"id":"S0221","desc":"Skill in extracting information from packet captures."},
{"id":"S0222","desc":"Skill in fusion analysis"},
{"id":"S0223","desc":"Skill in generating operation plans in support of mission and target requirements."},
{"id":"S0224","desc":"Skill in gisting target communications."},
{"id":"S0225","desc":"Skill in identifying a target’s communications networks."},
{"id":"S0226","desc":"Skill in identifying a target's network characteristics."},
{"id":"S0227","desc":"Skill in identifying alternative analytical interpretations to minimize unanticipated outcomes."},
{"id":"S0228","desc":"Skill in identifying critical target elements, to include critical target elements for the cyber domain."},
{"id":"S0229","desc":"Skill in identifying cyber threats which may jeopardize organization and/or partner interests."},
{"id":"S0230","desc":"Withdrawn - Integrated into S0066"},
{"id":"S0231","desc":"Skill in identifying how a target communicates."},
{"id":"S0232","desc":"Skill in identifying intelligence gaps and limitations."},
{"id":"S0233","desc":"Skill in identifying language issues that may have an impact on organization objectives."},
{"id":"S0234","desc":"Skill in identifying leads for target development."},
{"id":"S0235","desc":"Skill in identifying non-target regional languages and dialects"},
{"id":"S0236","desc":"Skill in identifying the devices that work at each level of protocol models."},
{"id":"S0237","desc":"Skill in identifying, locating, and tracking targets via geospatial analysis techniques"},
{"id":"S0238","desc":"Skill in information prioritization as it relates to operations."},
{"id":"S0239","desc":"Skill in interpreting compiled and interpretive programming languages."},
{"id":"S0240","desc":"Skill in interpreting metadata and content as applied by collection systems."},
{"id":"S0241","desc":"Skill in interpreting traceroute results, as they apply to network analysis and reconstruction."},
{"id":"S0242","desc":"Skill in interpreting vulnerability scanner results to identify vulnerabilities."},
{"id":"S0243","desc":"Skill in knowledge management, including technical documentation techniques (e.g., Wiki page)."},
{"id":"S0244","desc":"Skill in managing client relationships, including determining client needs/requirements, managing client expectations, and demonstrating commitment to delivering quality results."},
{"id":"S0245","desc":"Skill in navigating network visualization software."},
{"id":"S0246","desc":"Skill in number normalization."},
{"id":"S0247","desc":"Skill in performing data fusion from existing intelligence for enabling new and continued collection."},
{"id":"S0248","desc":"Skill in performing target system analysis."},
{"id":"S0249","desc":"Skill in preparing and presenting briefings."},
{"id":"S0250","desc":"Skill in preparing plans and related correspondence."},
{"id":"S0251","desc":"Skill in prioritizing target language material."},
{"id":"S0252","desc":"Skill in processing collected data for follow-on analysis."},
{"id":"S0253","desc":"Skill in providing analysis on target-related matters (e.g., language, cultural, communications)."},
{"id":"S0254","desc":"Skill in providing analysis to aid writing phased after action reports."},
{"id":"S0255","desc":"Skill in providing real-time, actionable geolocation information utilizing target infrastructures."},
{"id":"S0256","desc":"Skill in providing understanding of target or threat systems through the identification and link analysis of physical, functional, or behavioral relationships."},
{"id":"S0257","desc":"Skill in reading, interpreting, writing, modifying, and executing simple scripts (e.g., PERL, VBS) on Windows and Unix systems (e.g., those that perform tasks like parsing large data files, automating manual tasks, and fetching/processing remote data)."},
{"id":"S0258","desc":"Skill in recognizing and interpreting malicious network activity in traffic."},
{"id":"S0259","desc":"Skill in recognizing denial and deception techniques of the target."},
{"id":"S0260","desc":"Skill in recognizing midpoint opportunities and essential information."},
{"id":"S0261","desc":"Skill in recognizing relevance of information."},
{"id":"S0262","desc":"Skill in recognizing significant changes in a target’s communication patterns."},
{"id":"S0263","desc":"Skill in recognizing technical information that may be used for leads for metadata analysis."},
{"id":"S0264","desc":"Skill in recognizing technical information that may be used for leads to enable remote operations (data includes users, passwords, email addresses, IP ranges of the target, frequncy in DNI behavior, mail servers, domain servers, SMTP header information)."},
{"id":"S0265","desc":"Skill in recognizing technical information that may be used for target development including intelligence development."},
{"id":"S0266","desc":"Skill in relevant programming languages (e.g., C++, Python, etc.)."},
{"id":"S0267","desc":"Skill in remote command line and Graphic User Interface (GUI) tool usage."},
{"id":"S0268","desc":"Skill in researching essential information."},
{"id":"S0269","desc":"Skill in researching vulnerabilities and exploits utilized in traffic."},
{"id":"S0270","desc":"Skill in reverse engineering (e.g., hex editing, binary packaging utilities, debugging, and strings analysis) to identify function and ownership of remote tools."},
{"id":"S0271","desc":"Skill in reviewing and editing assessment products."},
{"id":"S0272","desc":"Skill in reviewing and editing intelligence products from various sources for cyber operations."},
{"id":"S0273","desc":"Skill in reviewing and editing plans."},
{"id":"S0274","desc":"Skill in reviewing and editing target materials."},
{"id":"S0275","desc":"Skill in server administration."},
{"id":"S0276","desc":"Skill in survey, collection, and analysis of wireless LAN metadata."},
{"id":"S0277","desc":"Skill in synthesizing, analyzing, and prioritizing meaning across data sets."},
{"id":"S0278","desc":"Skill in tailoring analysis to the necessary levels (e.g., classification and organizational)."},
{"id":"S0279","desc":"Skill in target development in direct support of collection operations."},
{"id":"S0280","desc":"Skill in target network anomaly identification (e.g., intrusions, dataflow or processing, target implementation of new technologies)."},
{"id":"S0281","desc":"Skill in technical writing."},
{"id":"S0282","desc":"Skill in testing and evaluating tools for implementation."},
{"id":"S0283","desc":"Skill in transcribing target language communications."},
{"id":"S0284","desc":"Skill in translating target graphic and/or voice language materials."},
{"id":"S0285","desc":"Skill in using Boolean operators to construct simple and complex queries."},
{"id":"S0286","desc":"Skill in using databases to identify target-relevant information."},
{"id":"S0287","desc":"Skill in using geospatial data and applying geospatial resources."},
{"id":"S0288","desc":"Skill in using multiple analytic tools, databases, and techniques (e.g., Analyst’s Notebook, A-Space, Anchory, M3, divergent/convergent thinking, link charts, matrices, etc.)."},
{"id":"S0289","desc":"Skill in using multiple search engines (e.g., Google, Yahoo, LexisNexis, DataStar) and tools in conducting open-source searches."},
{"id":"S0290","desc":"Skill in using non-attributable networks."},
{"id":"S0291","desc":"Skill in using research methods including multiple, different sources to reconstruct a target network."},
{"id":"S0292","desc":"Skill in using targeting databases and software packages."},
{"id":"S0293","desc":"Skill in using tools, techniques, and procedures to remotely exploit and establish persistence on a target."},
{"id":"S0294","desc":"Skill in using trace route tools and interpreting the results as they apply to network analysis and reconstruction."},
{"id":"S0295","desc":"Skill in using various open source data collection tools (online trade, DNS, mail, etc.)."},
{"id":"S0296","desc":"Skill in utilizing feedback to improve processes, products, and services."},
{"id":"S0297","desc":"Skill in utilizing virtual collaborative workspaces and/or tools (e.g., IWS, VTCs, chat rooms, SharePoint)."},
{"id":"S0298","desc":"Skill in verifying the integrity of all files. (e.g., checksums, Exclusive OR, secure hashes, check constraints, etc.)."},
{"id":"S0299","desc":"Skill in wireless network target analysis, templating, and geolocation."},
{"id":"S0300","desc":"Skill in writing (and submitting) requirements to meet gaps in technical capabilities."},
{"id":"S0301","desc":"Skill in writing about facts and ideas in a clear, convincing, and organized manner."},
{"id":"S0302","desc":"Skill in writing effectiveness reports."},
{"id":"S0303","desc":"Skill in writing, reviewing and editing cyber-related Intelligence/assessment products from multiple sources."},
{"id":"S0304","desc":"Skill to access information on current assets available, usage."},
{"id":"S0305","desc":"Skill to access the databases where plans/directives/guidance are maintained."},
{"id":"S0306","desc":"Skill to analyze strategic guidance for issues requiring clarification and/or additional guidance."},
{"id":"S0307","desc":"Skill to analyze target or threat sources of strength and morale."},
{"id":"S0308","desc":"Skill to anticipate intelligence capability employment requirements."},
{"id":"S0309","desc":"Skill to anticipate key target or threat activities which are likely to prompt a leadership decision."},
{"id":"S0310","desc":"Skill to apply analytical standards to evaluate intelligence products."},
{"id":"S0311","desc":"Skill to apply the capabilities, limitations and tasking methodologies of available platforms, sensors, architectures and apparatus as they apply to organization objectives."},
{"id":"S0312","desc":"Skill to apply the process used to assess the performance and impact of cyber operations."},
{"id":"S0313","desc":"Skill to articulate a needs statement/requirement and integrate new and emerging collection capabilities, accesses and/or processes into collection operations."},
{"id":"S0314","desc":"Skill to articulate intelligence capabilities available to support execution of the plan."},
{"id":"S0315","desc":"Skill to articulate the needs of joint planners to all-source analysts."},
{"id":"S0316","desc":"Skill to associate Intelligence gaps to priority information requirements and observables."},
{"id":"S0317","desc":"Skill to compare indicators/observables with requirements."},
{"id":"S0318","desc":"Skill to conceptualize the entirety of the intelligence process in the multiple domains and dimensions."},
{"id":"S0319","desc":"Skill to convert intelligence requirements into intelligence production tasks."},
{"id":"S0320","desc":"Skill to coordinate the development of tailored intelligence products."},
{"id":"S0321","desc":"Skill to correlate intelligence priorities to the allocation of intelligence resources/assets."},
{"id":"S0322","desc":"Skill to craft indicators of operational progress/success."},
{"id":"S0323","desc":"Skill to create and maintain up-to-date planning documents and tracking of services/production."},
{"id":"S0324","desc":"Skill to determine feasibility of collection."},
{"id":"S0325","desc":"Skill to develop a collection plan that clearly shows the discipline that can be used to collect the information needed."},
{"id":"S0326","desc":"Skill to distinguish between notional and actual resources and their applicability to the plan under development."},
{"id":"S0327","desc":"Skill to ensure that the collection strategy leverages all available resources."},
{"id":"S0328","desc":"Skill to evaluate factors of the operational environment to objectives, and information requirements."},
{"id":"S0329","desc":"Skill to evaluate requests for information to determine if response information exists."},
{"id":"S0330","desc":"Skill to evaluate the capabilities, limitations and tasking methodologies of organic, theater, national, coalition and other collection capabilities."},
{"id":"S0331","desc":"Skill to express orally and in writing the relationship between intelligence capability limitations and decision-making risk and impacts on the overall operation."},
{"id":"S0332","desc":"Skill to extract information from available tools and applications associated with collection requirements and collection operations management."},
{"id":"S0333","desc":"Skill to graphically depict decision support materials containing intelligence and partner capability estimates."},
{"id":"S0334","desc":"Skill to identify and apply tasking, collection, processing, exploitation and dissemination to associated collection disciplines."},
{"id":"S0335","desc":"Skill to identify Intelligence gaps."},
{"id":"S0336","desc":"Skill to identify when priority information requirements are satisfied."},
{"id":"S0337","desc":"Skill to implement established procedures for evaluating collection management and operations activities."},
{"id":"S0338","desc":"Skill to interpret planning guidance to discern level of analytical support required."},
{"id":"S0339","desc":"Skill to interpret readiness reporting, its operational relevance and intelligence collection impact."},
{"id":"S0340","desc":"Skill to monitor target or threat situation and environmental factors."},
{"id":"S0341","desc":"Skill to monitor threat effects to partner capabilities and maintain a running estimate."},
{"id":"S0342","desc":"Skill to optimize collection system performance through repeated adjustment, testing, and re-adjustment."},
{"id":"S0343","desc":"Skill to orchestrate intelligence planning teams, coordinate collection and production support, and monitor status."},
{"id":"S0344","desc":"Skill to prepare and deliver reports, presentations and briefings, to include using visual aids or presentation technology."},
{"id":"S0345","desc":"Skill to relate intelligence resources/assets to anticipated intelligence requirements."},
{"id":"S0346","desc":"Skill to resolve conflicting collection requirements."},
{"id":"S0347","desc":"Skill to review performance specifications and historical information about collection assets."},
{"id":"S0348","desc":"Skill to specify collections and/or taskings that must be conducted in the near term."},
{"id":"S0349","desc":"Skill to synchronize operational assessment procedures with the critical information requirement process."},
{"id":"S0350","desc":"Skill to synchronize planning activities and required intelligence support."},
{"id":"S0351","desc":"Skill to translate the capabilities, limitations and tasking methodologies of organic, theater, national, coalition and other collection capabilities."},
{"id":"S0352","desc":"Skill to use collaborative tools and environments for collection operations."},
{"id":"S0353","desc":"Skill to use systems and/or tools to track collection requirements and determine if they are satisfied."},
{"id":"S0354","desc":"Skill in creating policies that reflect the business’s core privacy objectives."},
{"id":"S0355","desc":"Skill in negotiating vendor agreements and evaluating vendor privacy practices"},
{"id":"S0356","desc":"Skill in communicating with all levels of management including Board members (e.g., interpersonal skills, approachability, effective listening skills, appropriate use of style and languge for the audience)."},
{"id":"S0357","desc":"Skill to anticipate new security threats."},
{"id":"S0358","desc":"Skill to remain aware of evolving technical infrastructures."},
{"id":"S0359","desc":"Skill to use critical thinking to analyze organizational patterns and relationships."},
{"id":"S0360","desc":"Skill to analyze and assess internal and external partner cyber operations capabilities and tools."},
{"id":"S0361","desc":"Skill to analyze and assess internal and external partner intelligence processes and the development of information requirements and essential information."},
{"id":"S0362","desc":"Skill to analyze and assess internal and external partner organization capabilities and limitations (those with tasking, collection, processing, exploitation and dissemination responsibilities)."},
{"id":"S0363","desc":"Skill to analyze and assess internal and external partner reporting."},
{"id":"S0364","desc":"Skill to develop insights about the context of an organization’s threat environment"},
{"id":"S0365","desc":"Skill to design incident response for cloud service models."},
{"id":"S0366","desc":"Skill to identify successful capabilities to find solutions to less common and more complex system problems."},
{"id":"S0367","desc":"Skill to apply cybersecurity and privacy principles to organizational requirements (relevant to confidentiality, integrity, availability, authentication, non-repudiation)."},
{"id":"S0368","desc":"Skill to use risk scoring to inform performance-based and cost-effective approaches to help organizations to identify, assess, and manage cybersecurity risk."},
{"id":"S0369","desc":"Skill to identify sources, characteristics, and uses of the organization’s data assets."},
{"id":"S0370","desc":"Skill to use cyber defense Service Provider reporting structure and processes within one’s own organization."},
{"id":"S0371","desc":"Skill to respond and take local actions in response to threat sharing alerts from service providers."},
{"id":"S0372","desc":"Skill to translate, track, and prioritize information needs and intelligence collection requirements across the extended enterprise."},
{"id":"S0373","desc":"Skill to ensure that accountability information is collected for information system and information and communications technology supply chain infrastructure components."},
{"id":"S0374","desc":"Skill to identify cybersecurity and privacy issues that stem from connections with internal and external customers and partner organizations."}
]
